# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-CBAM 改进版配置文件
# 基于你提供的 yolov8.yaml 修改

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # 用这个 Nano 版本
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, CBAM, [7]]       # 10 <---【修改1】新增第10层 CBAM (接在SPPF后面)

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 16 (这里对应原来的15，是P3输出) (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19 (这里对应原来的18，是P4输出) (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] #  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [[-1, 10], 1, Concat, [1]] # <---【修改2】注意这里！原版是9(SPPF)，改为10(CBAM)，让Head用上注意力特征
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large) #  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)

  - [[16, 19, 22], 1, Detect, [nc]] # 23 Detect(P3, P4, P5) <---【这里必须改成 16, 19, 22】
